{
	"name": "Target Chamber",
	"icon": "qmd:target_chamber_controller",
	"category": "qmd:particle_chambers",
	"sortnum": 1,
	"pages": [
		{
			"type": "text",
			"text": "Target Chambers are where you smash particle beams into a fixed target of material to induce nuclear reactions. They are useful for all sorts of things like transmuting elements to creating new particles."
		},
		{
			"type": "text",
			"text": ""
		},
		{
			"anchor": "construction",
			"title": "Construction",
			"type": "text",
			"text": "Target Chambers like all $(l:multiblocks/particle_chambers/general#construction)particle chambers$(/l) are constructed out of casing or glass and have an energy port.They can also have optional item ports. They are cubes that can be any odd size from 3 to 9 blocks across. They must have only one Particle Chamber Beam Port in input mode but can have from 0 to 3 beam ports in output mode. Beam ports can be placed in the center of any horizontal face."
		},
		{
            "type": "diagram_low",
			"image": "qmd:textures/gui/book_images/target_chamber_empty7.png",
            "text": "In the center there must be a Particle Chamber block connected to any beam ports via a line of Particle Chamber Beam blocks.$(br2)Below a size 7 target chamber with 2 beam port outputs and item ports."
        },
		{
			"title": "Outputs",
			"type": "text",
			"text": "There can be 0 to 3 output beams depending on how the target chamber is constructed. The position the outputs is in relation to the input. This determines which beam comes out of which beam port. The beams come out 1 to 3 clockwise viewed from the top and correspond top to bottom in the gui of the Target Chamber. But this can be switched by shift right clicking one of the 2 side beam ports with the multitool."
		},
		{
			"type": "text",
			"text": "The middle output beam will always come out the back.$(br2)Generally neutral particle beams will come out the middle port as they are not bent by magnetic fields."
		},
		{
			"anchor": "detectors",
			"title": "Detectors",
			"type": "text",
			"text": "Like all $(l:multiblocks/particle_chambers/general#detectors)particle chambers$(/l), target chambers can have detectors inside to increase the chambers efficiency at the cost of power.$(br2)The target chambers efficiency $(l)η$() modifies the recipe $(l:multiblocks/particle_chambers/general#cross section)cross-section$(/l) $(l)σ$() by $(l)Σ=$(o)min$(l)(ησ,1)$()"
		},
		{
			"type": "text",
			"text": ""
		},
		{
			"anchor": "operation",
			"header": "Operation",
			"type": "diagram",
			"image": "qmd:textures/gui/book_images/target_chamber_recipe.png",
			"text": "To show how the target chamber operates lets look at the example recipe in JEI above. Here neutrons hit aluminum ingots creating sodium-22, helions and neutrons."
		},
		{
			"type": "text",
			"text": "The first important thing is the range: 43 MeV-80 MeV. This means that the recipe only works if we input a beam of neutrons with an energy in this range.$(br2)Other things to note for later are the cross-section: 5% and the energy released: -42.1 MeV.$(br2)Also if we hover over the input (cyan box) neutron the focus says 0. This is the $(l)minimum$() focus required for the recipe. Most recipes have a minimum of 0."
		},
		{
			"title": "Recipe Speed",
			"type": "text",
			"text": "If we hover over the input neutron it tells us the amount is 20 Mpu. This means we need to supply 20 Mpu of neutrons to convert one aluminum into a sodium-22. For a 10 kpu/t beam this will take 20 Mpu/(10 kpu/t)=2000 t=100 seconds. But we can speed this up by either increasing the input beam pu/t or increasing the chamber efficiency. Lets say we have a efficiency of 290% then we have modified the $(l:multiblocks/particle_chambers/general#cross_section)cross-section$(/l) to 5%×290% = 14.5%. "
		},
		{
			"type": "text",
			"text": "This has decreased the amount of pu to complete the recipe to 20 Mpu/290%≈6.90Mpu. So the recipe completes 2.9× faster taking 689 t ≈ 34.5 seconds to complete. $(l)Note that the effective cross section can be only 100% at max$(), so if we have a chamber efficiency above 2000% (because 5%×2000%=100%) then it does not speed up the recipe anymore.$(br)The minimum amount of particles need can be calculated as $(l)aσ$(). So in this case is 20 Mpu×5% = 1 Mpu. "
		},
		{
			"type": "text",
			
			"text": "For normally balanced QMD (i.e no config or recipe changes) this is always 1 Mpu. $(br2)Because of this minimum amount of particles to complete the recipe the maximum speed of a recipe is still dependent on the input pu/t."
		},
		{
			"type": "text",
			"anchor": "output_particles",
			"title": "Output Particles",
			"text": "The recipe also has output particles. Hovering over the output neutron in JEI we see it has an amount of 3 pu. This means that for every input particle we get 3 output neutrons, if at 100% cross-section. The equation for the amount of particles outputted is $(l)aₒ=aᵢaΣ$() where $(l)aᵢ$() is the amount of particles inputted, $(l)a$() the amount shown in the recipe and $(l)Σ$() the $(l:multiblocks/particle_chambers/target_chamber#detectors)effective cross-section$(/l)."
		},
		{
			"type": "diagram_low",
			"image": "qmd:textures/gui/book_images/target_chamber_gui.png",
			"text": "In our example below we are putting in 10 kpu/t and have a chamber efficiency of 290%, so the effective cross-section is 14.5%, therefore the output is 10kpu/t×3pu×14.5% = 4.35kpu/t as can be seen hovering over the output neutrons."
		},
		{
			"type": "text",
			"text": "The energy of the output particles is calculated as $(br)$(l)E=(E₀+Q)/n$() where $(l)E₀$() is the input particle energy, $(l)Q$() is the energy released in the recipe and $(l)n$() is the total amount of particles released in the recipe.$(br2)In our example case we are putting in neutrons at 45 MeV and the energy released is -42.1 MeV. In JEI 3 neutrons and 1 helion is the output so $(l)n=$()4. Thus in this case (45 MeV + -42.1MeV)/4 = 725 keV as seen in the image to the left."
		},
		{
			"anchor": "focus_loss",
			"type": "text",
			"title": "Focus Loss",
			"text": "Like in accelerators and beamlines, particles in target chambers loose focus with every block traveled. The distance traveled is the beam length is shown in the gui. The loss in focus is calculated the same as $(l:particles/introduction#focus_loss)normal$(/l) but there is a few things to note: the input particle travels half the beam length and so does the output particle."
		},
		{
			"type": "text",
			"text": "So in our example the input neutron beam is at 5 focus and the beam length is 5, so the input and output particle both travel 2.5 blocks. If we want to calculate the focus for the output helion then we do $(br) 5-2.5×0.002(1+0×sqrt(10kpu/10k))-2.5×0.002(1+2×sqrt(1.45kpu/10k)≈ 4.862 (the gui rounds it to 3 decimal places).$(br)This is a bit complicated but really just remember to have high focus and you don't really need to worry about the specifics, because too much focus is never a bad thing."
		}
	]
}