{
	"name": "Linear Accelertor",
	"icon": "qmd:linear_accelerator_controller",
	"category": "qmd:accelerators",
	"sortnum": 1,
	"pages": [
		{
			
			"type": "text",
			"text": "Linear Accelerators are used to either create particle beams and increase their energy and focus or to increase the energy and focus of an existing particle beam. $(br2)The change in energy and focus is determined from the $(l:multiblocks/accelerators/general#structure)structures$(/l) inside the accelerator."
		},
		{
			
			"type": "diagram_high",
			"image":"qmd:textures/gui/book_images/linac.png",
			"text": "Example Linear Accelerator." 
		},
		{
			
			"title": "Construction",
			"type": "text",
			"image":"qmd:textures/gui/book_images/linac_empty.png",
			"text": "Linear accelerators like all like all $(l:multiblocks/accelerators/general#construction)Accelerators$(/l) are constructed out of casing or glass and require Coolant Vent in input and output modes and an Energy Port. They are 5 wide and tall by at least 6 long. They must have a continuous line of Accelerator Beams blocks down the center." 
		},
		{
			"type": "diagram_low",
			"image":"qmd:textures/gui/book_images/linac_empty.png",
			"text": "Where the beam blocks meet the casing there must be an Accelerator Ion source at one end and an Accelerator Beam Port in output mode at the other. Example of a empty linear accelerator below."
		},
		{
			
			"type": "diagram_low",
			"image":"qmd:textures/gui/book_images/linac_empty_input.png",
			"text": "Alternatively the Ion Source can be replaced by a beam port in input mode to use an already existing beam. Example shown below"
		},
		{
			"anchor": "ion_source",
			"title": "Ion source",
			"type": "text",
			"text": "At the start of any accelerator system there will be a linear accelerator with an ion source. Ion sources are used to create new particle beams with ion source items. These ion source items can be found in JEI by looking at the Accelerator Ion Source block's uses. These items can be piped in and out of the ion source either directly or through an Accelerator Item Port. It also has a gui for manual access."
		},
        {
            "title": "Operation",
            "type": "text",
            "text": "Linear accelerators function and have the same requirements as all $(l:multiblocks/accelerators/general#operation)accelerators$(/l), needing energy and coolant to operate."
        },
        {
            "title": "Particle Energy",
            "type": "text",
            "text": "The maximum outputted Particle Energy is calculated using $(l)Eₓ=E₀+|q|V$() where $(l)E₀$() is the starting energy (normally 0 for an Ion source), $(l)q$() is the particles charge and $(l)V$() is the accelerators voltage which is the sum of all the RF Cavities (the structure not the block) voltages."
        },
        {
            "anchor": "redstone",
			"title": "Redstone Control",
            "type": "text",
            "text": "The output particle energy can be controlled with the strength of the redstone signal according to $(l)E=Eₓ*Sr/15$() where $(l)Sᵣ$() is the redstone strength. If a redstone strength of 15 (max) is applied to the controller it will output the maximum energy anything less than 15 it will output the corresponding fraction of the maximum energy for example a redstone strength of 2 is 2/15= 13.3% of the max energy."
        }
	]
}