{
	"name": "Synchrotron Accelerator",
	"icon": "qmd:ring_accelerator_controller",
	"category": "qmd:accelerators",
	"sortnum": 2,
	"pages": [
		{
			
			"type": "text",
			"text": "Synchrotron Accelerators accelerate particles put into them to much higher energies than $(l:multiblocks/accelerators/linear_accelerator)Linear Accelerators$(/l), but can not be the start of an accelerator system. This must be a linear accelerator with a $(l:multiblocks/accelerators/linear_accelerator#ion_source)ion source$(/l). $(bold)Synchrotrons have a minimum input particle energy$() this is usually 5 MeV but can be changed in the configs."
		},
		{
			"type": "diagram_high",
			"image":"qmd:textures/gui/book_images/ring.png",
			"text": "Example Synchrotron Accelerator." 
		},
		{
			"anchor": "construction",
			"title": "Construction",
			"type": "text",
			"text": "Synchrotron Accelerators are a square torus of Accelerator Casings or Glass that must be 5 wide. Like all $(l:multiblocks/accelerators/general#construction)accelerators$(/l) they require a Coolant vent in input and output modes and an Energy Port. There must be a continuous ring of Accelerator Beams blocks down the center and any beam port with a connecting beam block connecting it to the beam ring. Example shown on the opposite page."
		},
		{
			"type": "diagram_high",
			"image":"qmd:textures/gui/book_images/ring_beam.png",
			"text": "At each corner and beam port intersection there must be a $(l:multiblocks/accelerators/general#dipole)dipole magnet$(/l). So an synchrotron has a minimum of 4 dipoles. The example above will require at least 5 dipoles." 
		},
		{
			"type": "diagram_low",
			"image":"qmd:textures/gui/book_images/ring_cooler.png",
			"text": "Lastly, the inside corners of the accelerator must not be accelerator casing or accelerator glass. That area can instead be used to place certain coolers! Example below." 
		},
		{
            "anchor": "operation",
			"title": "Operation",
			"type": "text",
			"text": "A Synchrotron Accelerator functions the same as any other $(l:multiblocks/accelerators/general#operation)accelerator$(/l) requiring power and coolant. It requires an existing particle beam to be pipe in at a minimum energy of 5 MeV (by default). Synchrotrons can have multiple beam ports but only one can be an input and output at any given time. $(l:multiblocks/accelerators/beam_diverter#switching)Switching beam ports$(/l) can be down automatically with redstone or open computers."
        },
		{     
			"type": "text",
			"text": "Just like the $(l:multiblocks/accelerators/general#dipole)Linear Accelerator$(/l) a redstone signal applied to the controller will turn it on and the output particle energy will $(l)E=EₓSᵣ/15$()."
        },		
		{
           "title": "Particle Energy",
			"type": "text",
			"text": "The resulting particle energy is more complicated to figure out than in a linear accelerator. The energy is limited by 2 factors, whichever factor is smaller will be the maximum particle output energy $(l)Eₓ=$(o)min$()$(l)(Eᵩ,Eᵣ)$(). These factors are from the dipole field strength and the synchrotron radiation losses."
        },
		{
			"anchor": "max_dipole",
			"title": "Max From Dipole Strength",
			"type": "text",
			"text": "The maximum energy (in GeV) from the dipole strength is $(l)Eᵩ=(qB₂dR)²/(2m)$() where $(l)q$() is the particles charge, $(l)B₂$() is the dipole strength which is the sum of the strengths of the dipoles, $(l)R$() is the radius of the synchrotron and $(l)m$() is the mass of the particle in MeV/c^2. For heavy particles like the proton this is the major concern."
        },
		{
			"anchor": "max_radiation",
			"title": "Max From Radiation",
			"type": "text",
			"text": "The maximum energy (in GeV) from the Radiation losses $(l)Eᵣ=m(3VR/|q|)⁰˙²⁵$() where $(l)V$() is the accelerator's voltage (in kV). For light particles like the electron this is the major concern."
        },
		{     
			"type": "text",
			"title": "Beam Port Switching",
			"text": "A redstone pulse applied to a disabled beam port will make that beam port the 'active' beam port. What it switches to (either output or input) can be controlled by shift right clicking the beam port with the multitool."
        },
		{
            "anchor": "synchrotron_Port",
		    "header": "Synchrotron Ports",
			"type": "diagram",
			"image":"qmd:textures/gui/book_images/synch_port.png",
			"text": "Synchrotron accelerators can have a special port installed an Accelerator Synchrotron Port. This port lets out synchrotron radiation (High energy photons). The same position rules as beam ports apply to Synchrotron ports. Only one can be installed."
        },
		{
			"type": "text",
			"text": "The amount of pu/t of photons produced is equal to the amount of pu/t of particles going through the synchrotron, the focus is the same as the particles going through the synchrotron and the energy (in MeV) is $(l)Eᵧ=E³/(2πR(1000m)³)$() where $(l)E$() is the energy (in MeV) of the particle outputted by the synchrotron. $(br2)Because the energy is proportional to $(l)1/m³$() light particles like electrons give much higher energy."
        }
	]
}